#include <iostream>
#include <iostream>
#include <iomanip>
#include <cmath>
#include <vector>
#include <algorithm>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int i;
	vector<double> heights = { 1, 1.5, 5.2, 9.9, 10.0, -12.3, 25.7, 8.4, 30.1 };
	vector<double> times = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
	auto it = find_if(heights.begin(), heights.end(), [](double h) { return h <=
		0.0; });
	if (it == heights.end()) {
		cout << "падения не было" << endl;
	}
	else {
		size_t idx = distance(heights.begin(), it); 
		double t_fall = times[idx];
		cout << "врея падения, c: " << t_fall << endl;
		cout << "heights[idx]: " << heights[idx] << endl;
	}
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
